app/views/users/new.html.erb

SELECT "courses".* FROM "courses"
---
          <%= f.label :course %>
          <%= f.collection_select(:course_Id, Course.all, :id, :name ) %>