app/views/subjects/show.html.erb

    <h4>related courses</h4>
    <% subject.courses.each do |course| %>
---
SELECT "courses".* FROM "courses" INNER JOIN "courses_subjects" ON "courses"."id" = "courses_subjects"."course_id" WHERE "courses_subjects"."subject_id" = ?  [["subject_id", 1]]

    <h4>students that feedback the courses</h4>
    <% subject.feedbacks.each do |feedback| %>
    <p><%= link_to User.find(feedback.user_id).name, userShow_path(:id => feedback.user_id) %></p>
---
SELECT "feedbacks".* FROM "feedbacks"  WHERE "feedbacks"."subject_id" = ?  [["subject_id", 1]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]