app/views/feedbacks/new.html.erb

    <%= f.label :subject_id %>
    <%= f.collection_select(:subject_id, Subject.all, :id, :name ) %>
---
SELECT "subjects".* FROM "subjects"