app/views/feedbacks/new.html.erb

    <%= f.label :subject_id %>
    <%= f.collection_select(:subject_id, Course.find(current_user.course_Id).subjects, :id, :name ) %>
---
SELECT  "courses".* FROM "courses"  WHERE "courses"."id" = ? LIMIT 1  [["id", 3]]
SELECT "subjects".* FROM "subjects" INNER JOIN "courses_subjects" ON "subjects"."id" = "courses_subjects"."subject_id" WHERE "courses_subjects"."course_id" = ?  [["course_id", 1]]

    <%= f.label :strengths %>
        <%= f.select :strengths, {"strengths 1" => '1', "strengths 2" => '2',"strengths 3" => '3',"strengths 4" => '4',"strengths 5" => '5',} %>
---
SELECT "strengths".* FROM "strengths"