app/views/feedbacks/search.html.erb

SELECT  "subjects".* FROM "subjects"  WHERE "subjects"."name" = 'subject1' LIMIT 1
---
    <%= f.label :subject %>
    <%= f.collection_select(:subject_id, Subject.all, :id, :name ) %>

SELECT  "subjects".* FROM "subjects"  WHERE "subjects"."id" = ? LIMIT 1  [["id", 1]]
---
    <h3>subject</h3>
    <p><%= Subject.find(feedback.subject_id).name %></p>