app/views/feedbacks/showStudentsNoFeedback.html.erb

SELECT "feedbacks".* FROM "feedbacks"  WHERE "feedbacks"."user_id" = ?  [["user_id", 5]]
SELECT COUNT(*) FROM "feedbacks"  WHERE "feedbacks"."user_id" = ?  [["user_id", 1]]
---
<br />
    <% if user.feedbacks.size == 0 %>