app/views/feedbacks/show.html.erb

SELECT  "subjects".* FROM "subjects"  WHERE "subjects"."id" = ? LIMIT 1  [["id", 1]]
---
    <h3>subject</h3>
    <p><%= Subject.find(feedback.subject_id).name %></p>