app/views/courses/show.html.erb

SELECT "subjects".* FROM "subjects" INNER JOIN "courses_subjects" ON "subjects"."id" = "courses_subjects"."subject_id" WHERE "courses_subjects"."course_id" = ?  [["course_id", 1]]
---
    <h4>include subjects</h4>
    <% course.subjects.each do |subject| %>