app/controllers/courses_controller.rb

 def show
	 @courses = Course.all
---
SELECT "courses".* FROM "courses"

  def destroy
  		 course.destroy

    @courses = Course.all
---
SELECT "courses".* FROM "courses"