app/controllers/feedbacks_controller.rb

SELECT "feedbacks".* FROM "feedbacks"
---
  def show
	 @feedbacks = Feedback.all

SELECT "users".* FROM "users"
---
  def showStudentsNoFeedback
   # @feedbacks = current_user.feedbacks
   @users = User.all

INSERT INTO "feedbacks" ("created_at", "rate", "recommendations", "subjectName", "updated_at", "user_id", "weaknesses") VALUES (?, ?, ?, ?, ?, ?, ?)  [["created_at", "2014-11-12 01:56:39.840362"], ["rate", 1], ["recommendations", "2222"], ["subjectName", "222"], ["updated_at", "2014-11-12 01:56:39.840362"], ["user_id", 3], ["weaknesses", "2222"]]
---
  def create
    feecback_params = params.require(:feedback).
                      permit(:subject_id, :strengths, :weaknesses,:recommendations,:rate)
    @feedback = current_user.feedbacks.build(feecback_params)
    if @feedback.save

SELECT  "subjects".* FROM "subjects"  WHERE "subjects"."id" = ? LIMIT 1  [["id", 1]]
SELECT "feedbacks".* FROM "feedbacks"  WHERE "feedbacks"."subject_id" = ?  [[nil, 1]]
---
   def search
    if params && params[:feedback] && params[:feedback][:subject_id]
      @subject = Subject.find(params[:feedback][:subject_id])