app/controllers/subjects_controller.rb

SELECT "subjects".* FROM "subjects"
---
  def show
	 @subjects = Subject.all