app/controllers/users_controller.rb

      def create
        secure_params = params.require(:user).permit(:name, :email,
                                  :studentId, :password, :password_confirmation)
        @user = User.new(secure_params)
        if @user.save
---
INSERT INTO "users" ("course_Id", "created_at", "email", "name", "password_digest", "remember_token", "studentId", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)